In [11]:
import numpy as np
import pandas as pd

In [12]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [13]:
# all unique values in col2
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [14]:
len(df['col2'].unique())

3

In [16]:
df['col2'].nunique()

3

In [18]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# selecting data

In [19]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [23]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

# apply method

In [24]:
def times2(x):
    return x*2

In [25]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [27]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [30]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

# combined with lambda expresions

In [39]:
df['col2'].apply(lambda x : 0.01*x)

0    4.44
1    5.55
2    6.66
3    4.44
Name: col2, dtype: float64

In [43]:
df['col2'].apply(lambda x : np.log10(x))

0    2.647383
1    2.744293
2    2.823474
3    2.647383
Name: col2, dtype: float64

# removing columns

In [45]:
df.drop(columns='col1')

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [48]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [49]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

# sorting

In [50]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [54]:
np.NaN

nan